[
    {
    "stage": 1,
    "name": "Conwy",
    "group": "Greetings",
    "groupID": 1,
    "x": 1300,
    "y": 400,
    "description": "A picturesque medieval walled town dominated by the imposing Conwy Castle, a UNESCO World Heritage Site. The remarkably intact town walls, historic suspension bridge, and quaint harbor make this one of North Wales' most photogenic destinations."
  },
  {
    "stage": 2,
    "name": "Cwtch",
    "group": "Family",
    "groupID": 19,
    "x": 1600,
    "y": 2900,
    "description": "A Cwtch is a cosy spot in Wales known for its warm, homely atmosphere. It's also a term for a hug with a sense of comfort and affection that goes beyond a simple hug. The English can cuddle, but only the Welsh Cwtch."
  },
  {
    "stage": 3,
    "name": "Love Spoon Carving",
    "group": "Feelings",
    "groupID": 13,
    "x": 1300,
    "y": 1200,
    "description": "Love spoons are traditional hand-carved wooden spoons from Wales, historically given as tokens of affection and courtship. Each spoon features intricate designs and symbols, such as hearts or knots, representing love, commitment, and good fortune."
  },
  {
    "stage": 4,
    "name": "Llanfairpwllgwyngyllgogerychwyrndrobwllllantysiliogogogoch",
    "group": "Places",
    "groupID": 5,
    "x": 940,
    "y": 520,
    "description": "The village with the longest place name in Europe (and second longest in the world) at 58 characters. Originally a publicity stunt in the 1860s, the name translates to 'St Mary's Church in the hollow of the white hazel near a rapid whirlpool and the Church of St. Tysilio near the red cave.'"
  },
  {
    "stage": 5,
    "name": "Welsh Bakery",
    "group": "Food & Drink",
    "groupID": 6,
    "x": 1000,
    "y": 2000,
    "description": "Welsh cakes are soft, buttery griddle cakes studded with currants, offering a delicate balance of sweetness and spice with a melt-in-the-mouth texture. They hold a cherished place in Welsh culture as a traditional treat served at gatherings and celebrations, symbolizing warmth, hospitality, and heritage."
  },
  {
    "stage": 6,
    "name": "Principality Stadium",
    "group": "Sports",
    "groupID": 23,
    "x": 1970,
    "y": 2850,
    "description": "The rugby stadium near Wales' capital, Cardiff. Rugby is a source of national pride for the Welsh. When the team wins, the whole country celebrates; when they lose, everyone suddenly becomes an expert coach!"
  },
  {
    "stage": 7,
    "name": "Cartref - Welsh Cottage",
    "group": "HouseholdObjects",
    "groupID": 17,
    "x": 2150,
    "y": 2700,
    "description": "The humble Welsh cottage is something of a staple in Wales. "
  },
  {
    "stage": 8,
    "name": "Wales Coastal Path",
    "group": "TravelDirections",
    "groupID": 25,
    "x": 600,
    "y": 1050,
    "description": "The Wales Coast Path is a walking route that stretches around the entire Welsh coastline. Offering stunning views and beaches, some people walk or run the around the entire country of Wales using the Wales Coast Path and Offa's Dyke (which follows the border between Wales and England)."
  },
  {
    "stage": 9,
    "name": "Clothing and Body",
    "group": "BodyClothes",
    "groupID": 15,
    "x": 1050,
    "y": 2770,
    "description": ""
  },
  {
    "stage": 10,
    "name": "Yr Wyddfa - Snowdonia",
    "group": "WeatherNature",
    "groupID": 7,
    "x": 1150,
    "y": 720,
    "description": "Snowdon - Yr Wyddfa is the highest mountain in Wales, standing at 1,085 metres, and is located in Snowdonia National Park. It is famous for its stunning views and is a popular destination for walkers and climbers."
  },
  {
    "stage": 11,
    "name": "Dinbych Y Pysgod - Tenby",
    "group": "Colour",
    "groupID": 9,
    "x": 600,
    "y": 2650,
    "description": "Tenby is a cute colourful seaside village with colourful beach houses. Once a year, the entire village rallys together for the Ironman Wales - Cymru, and the Mayor congratulates every finisher personally as they cross the finish line."
  },
  {
    "stage": 12,
    "name": "Welsh Choir",
    "group": "Hobbies",
    "groupID": 24,
    "x": 1600,
    "y": 2350,
    "description": ""
  },
  {
    "stage": 13,
    "name": "Beddgelert",
    "group": "DescribingThings",
    "groupID": 12,
    "x": 1150,
    "y": 840,
    "description": "Beddgelert is the home of Gelert, a Welsh legend about Prince Llywelyn and his loyal dog. Tragically, Llywelyn mistakenly kills Gelert, thinking the dog harmed his child, only to discover Gelert had loyally saved the child from a wolf."
  },
  {
    "stage": 14,
    "name": "Harcombe farm",
    "group": "Animals",
    "groupID": 22,
    "x": 1550,
    "y": 1640,
    "description": "Farming and sheep are a big part of Welsh culture. There are more sheep than people in Wales! There are even Welsh specific idioms around sheep, such as 'mynd yn draed defaid,' literally meaning 'to turn into sheep's feet', similar to how something has 'gone to the dogs' in English."
  }
]
